Revit 2027 API
View.SunAndShadowSettings Property
The sun and shadow settings assigned to the view for shadow calculation and rendering.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public SunAndShadowSettings SunAndShadowSettings { get; }
Public ReadOnly Property SunAndShadowSettings As SunAndShadowSettings
	Get
public:
property SunAndShadowSettings^ SunAndShadowSettings {
	SunAndShadowSettings^ get ();
}
member SunAndShadowSettings : SunAndShadowSettings with get
Property Value
SunAndShadowSettings
The sun and shadow settings, or null for views which don't allow this (such as schedules).
See Also
Reference
View Class
Autodesk.Revit.DB Namespace